# Assignment 2

# MAS DSE200
### Due **October 19th, 2020**

## Instructions
 
* You don’t need to explain your approach (unless specified) so please be concise in your submission. 
* To obtain full marks for a question, both the answer and the code should be correct. 
* Completely wrong (or missing) code with correct answer will result in zero marks. 
* Please code the solution in the space provided.
* Please submit **both the PDF and IPynb** files

### Imports

Import necessary packages

In [2]:
import pandas as pd
import numpy as np

## Part 1: Titanic

### Preliminaries

Grab the dataset from [here](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/titanic.csv) and store it in a Pandas dataframe called passengers.

In [3]:
passengers = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/titanic.csv', sep=',')
passengers.to_csv('passengers.csv', sep=',', index=False)

In [4]:
passengers = pd.read_csv('./passengers.csv')

### 1: Get to know your data

**1.1**: Print the first 10 entries in the dataframe to see what the columns are and what some values will look like.

In [5]:
passengers

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

**1.2**: Next, set the index of the dataframe to the `PassengerId` column, and print the first 10 elements again to ensure the change took place.

**1.3**: How many samples are there in this dataset?

### 3:  Number of passengers in different classes

**3.1**: What is the number of passenges in different classes according to this dataset? (Hint: Pclass represents the class of a passenger.)

### 4:  Fares

**4.1**: How many different fares were charged on the Titanic based on the dataset?

**4.2**: Find the top 10 fares charged from the passengers. **Report these fare values**, and then **calculate the total number of passengers** who paid one of these fares (every passenger paid a unique fare value).

**4.3**: Create a new dataframe, called `passengers_filtered`, that includes only entries of passengers who paid one of these top 10 fares. **Report the number of samples** in the original dataset and in the new dataset to ensure the desired effect took place.

**hint:** Check out the Pandas Series function [isin](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.isin.html)

### 5:  Ages

**5.1**: What was the minimum, maximum and average age of passengers on the Titanic?

**5.2**: How many passengers on the Titanic were within two standard deviations of the mean age calculated in **5.1**?

**5.3**: How many of the passengers found in **5.2** were females over the age of 25?

**5.4**: What are the 10 **most** common ages of passengers according to this dataset?

## Part 2: Alcohol

In [ ]:
drinks = pd.read_csv('./drinks.csv', sep=',')

**6**: Print the first 5 entries in the dataframe

**7**: What country has the highest number of wine servings, and what is this number? What countries consume no wine?

**8**: What country has the highest beer + wine consumption?

**9**: Among the countries that consume at least some beer, which country consumes the least combined alcohol(beer+wine+spirit)?<Br>

**10**: Are there countries that consume some(non-zero) spirit and some(non-zero) wine and no beer? If so, which countries?

## Part 3: Numpy

**11**: Generate an integer random numpy array, A, of shape (5,5) with elements from 1 to 5(including 1 and 5). Print the generated random array. (Hint: Look at the documentation of numpy.random.randint)

**12** Print the transpose of A.

**13** Print the first 3 rows of A.

**14** Print the first 3 columns of A.

**15** Add this vector B=[1,2,3,4,5] to all the rows of A. (Hint: Use broadcasting)

**16** Add this vector B=[1,2,3,4,5] to all the columns of A. (Hint: Use np.reshape and broadcasting)